//intermediate_question,c1,c2,c3,
List lst = [
  ["Q1にほんにいるダンゴムシのしゅるいはなんしゅるい？", "１.　３しゅるい", "２.　１０しゅるい", "３.　２５しゅるい",],
  ["Q2たまに にほんで あおいダンゴムシがみつかるけど　なぜあおいの？", "１.　とつぜんへんい", "２.　びょうきのせい", "３.　そういうめずらしいしゅるいだから",],
  ["Q3ダンゴムシの あかちゃんの あしのかずは？", "１.　６ほん", "２.　１２ほん", "３.　１４ほん",],
  ["Q4にほんで　よくみる「オカダンゴムシ」は　もとは　どこからやってきた？", "１.　アメリカ", "2. ヨーロッパ", "３.　アフリカ",],
  ["Q5ダンゴムシは　かべに　ぶつかると　どのほうこうにすすむ？", "１.　みぎ", "２.　ひだり", "３.　ぜんかいまがったほうと　ぎゃくのほうこう",],
];

////intermediate_question,c1,c2,c3の回答
List lst2 = [
  [false, false, true],
  [false, true, false],
  [false, true, false],
  [false, true, false],
  [false, false, true],
];