//intermediate_question,c1,c2,c3,
List lst = [
  ["Q1ダンゴムシがまるくなるのはなぜ？", "１.てきから みを まもるため", "２.ねむるため", "３.はずかしがりやさんだから",],
  ["Q2ダンゴムシがすきなばしょは？", "１.あかるくてぽかぽかしたばしょ", "２.くらくてじめじめしたばしょ", "３.きのうえ",],
  ["Q3ダンゴムシはどうしてだっぴするの？", "１.からだがおおきくなったから", "２.あついから", "３.からだがよごれたから",],
  ["Q4ダンゴムシのじゅみょうは？", "１.　1年", "2. 3〜5年", "３.　10年",],
  ["Q5ダンゴムシのあしのかずは？", "１.　６本", "２.　１２本", "３.　１４本",],
];

////intermediate_question,c1,c2,c3の回答
List lst2 = [
  [true, false, false],
  [false, true, false],
  [true, false, false],
  [false, true, false],
  [false, false, true],
];